<a href="https://colab.research.google.com/github/Kwangbin/titanic/blob/main/titanic_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 타이타닉 통계 분석

In [1]:
from IPython.display import Image
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = sns.load_dataset('titanic')
df.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

##컬럼(columns) 설명

survivied: 생존여부 (1: 생존, 0: 사망)

pclass: 좌석 등급 (1등급, 2등급, 3등급)

sex: 성별

age: 나이

sibsp: 형제 + 배우자 수

parch: 부모 + 자녀 수

fare: 좌석 요금

embarked: 탑승 항구 (S, C, Q)

class: pclass와 동일

who: 성별과 동일

adult_male: 성인 남자 여부

deck: 데크 번호 (알파벳 + 숫자 혼용)

embark_town: 탑승 항구 이름

alive: 생존여부 (yes, no)

alone: 혼자 탑승 여부

##describe() - 요약통계
전반적인 주요 통계를 확인할 수 있습니다.

기본 값으로 수치형(Numerical) 컬럼에 대한 통계표를 보여줍니다.

count: 데이터 개수

mean: 평균

std: 표준편차

min: 최솟값

max: 최대값

In [4]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

문자열 컬럼에 대한 통계표도 확인할 수 있습니다.

count: 데이터 개수

unique: 고유 데이터의 값 개수

top: 가장 많이 출현한 데이터 개수

freq: 가장 많이 출현한 데이터의 빈도수

In [5]:
df.describe(include ='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

###count() - 개수
데이터의 개수

In [7]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [8]:
#단일 컬럼 = 열을 카운트

df['age'].count()

714

###mean() - 평균
데이터의 평균

In [9]:
df.mean()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [10]:
#컬럼 평균

df['age'].mean()

29.69911764705882

###Mean - 조건별 평균
성인 남성의 나이의 평균 구하기

In [11]:
con1= df['who']=='man'

df.loc[con1,'age'].mean()

33.17312348668281

###연습문제
다음 조건을 만족하는 승객의 나이 평균과 조건을 만족하는 데이터의 개수를 구하세요.

fare를 30 이상 40 미만 지불한 승객
pclass는 1등급

In [12]:
con2 = (df['fare']>=30) & (df['fare'] <=40) 
con3 = (df['pclass'] == 1)

df.loc[con2 & con3]

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
23          1       1    male  28.0  ...     A  Southampton    yes   True
55          1       1    male   NaN  ...     C  Southampton    yes   True
96          0       1    male  71.0  ...     A    Cherbourg     no   True
170         0       1    male  61.0  ...     B  Southampton     no   True
174         0       1    male  56.0  ...     A    Cherbourg     no   True
209         1       1    male  40.0  ...     A    Cherbourg    yes   True
270         0       1    male   NaN  ...   NaN  Southampton     no   True
298         1       1    male   NaN  ...     C  Southampton    yes   True
339         0       1    male  45.0  ...   NaN  Southampton     no   True
351         0       1    male   NaN  ...     C  Southampton     no   True
449         1       1    male  52.0  ...     C  Southampton    yes   True
462         0       1    male  47.0  ...     E  Southampton     no   True
492         0       1    male  55.0  ...     C  Southampton     no   True
515         0       1    male  47.0  ...     D  Southampton     no   True
556         1       1  female  48.0  ...     A    Cherbourg    yes  False
607         1       1    male  27.0  ...   NaN  Southampton    yes   True
625         0       1    male  61.0  ...     D  Southampton     no   True
630         1       1    male  80.0  ...     A  Southampton    yes   True
632         1       1    male  32.0  ...     B    Cherbourg    yes   True
647         1       1    male  56.0  ...     A    Cherbourg    yes   True
740         1       1    male   NaN  ...     D  Southampton    yes   True
766         0       1    male   NaN  ...   NaN    Cherbourg     no   True
782         0       1    male  29.0  ...     D  Southampton     no   True
793         0       1    male   NaN  ...   NaN    Cherbourg     no   True
842         1       1  female  30.0  ...   NaN    Cherbourg    yes   True
853         1       1  female  16.0  ...     D  Southampton    yes  False
887         1       1  female  19.0  ...     B  Southampton    yes   True
889         1       1    male  26.0  ...     C    Cherbourg    yes   True

[28 rows x 15 columns]

In [13]:
df.loc[con2 & con3, 'age'].mean()

44.095238095238095

In [14]:
df.loc[con2 & con3, 'age'].count()

21

###skipna=True 옵션
기술 통계 함수에서는 skipna=True가 기본으로 설정 되어 있습니다.

만약, skipna=False로 설정하게 된다면, NaN 값이 있는 column은 NaN 값으로 출력 됩니다.

In [15]:
# skipna=False를 지정한 경우
df.mean(skipna=False)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [16]:
# skipna=True를 지정한 경우
df.mean(skipna=True)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

##median() - 중앙값
데이터의 중앙 값을 출력 합니다. 데이터를 오름차순 정렬하여 중앙에 위치한 값입니다.

이상치(outlier)가 존재하는 경우, mean()보다 median()을 대표값으로 더 선호합니다.

In [17]:
pd.Series([1, 2, 3, 4, 5]).median()

3.0

In [18]:
pd.Series([4, 5, 1, 2, 3]).median()

3.0

In [19]:
#짝수개의 데이터가 있는 경우에는 가운데 2개 중앙 데이터의 평균 값을 출력 합니다.
pd.Series([1, 2, 3, 4, 5, 6]).median()

3.5

In [22]:
# 타이타닉 승객의 평균 나잉와 중앙 값을 구하면 차이를 알수 있다

a=df['age'].mean()
a

29.69911764705882

In [23]:
b=df['age'].median()
b

28.0

In [27]:
print("평균과 중앙값의 차이는: ", a - b)

평균과 중앙값의 차이는:  1.69911764705882

In [26]:
a-b

1.69911764705882

##sum() - 합계
데이터의 합계입니다. 

문자열 column은 모든 데이터가 붙어서 출력될 수 있습니다.

In [28]:
df.sum()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

survived                                                    342
pclass                                                     2057
sex           malefemalefemalefemalemalemalemalemalefemalefe...
age                                                    21205.17
sibsp                                                       466
parch                                                       340
fare                                                 28693.9493
who           manwomanwomanwomanmanmanmanchildwomanchildchil...
adult_male                                                  537
alive         noyesyesyesnonononoyesyesyesyesnononoyesnoyesn...
alone                                                       537
dtype: object

In [30]:
df['fare'].sum()

28693.9493

###cumsum() - 누적합, 
###cumprod() - 누적곱

In [31]:
df['fare'].cumsum()

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [32]:
df['fare'].cumprod()

0      7.250000e+00
1      5.168039e+02
2      4.095671e+03
3      2.174801e+05
4      1.750715e+06
           ...
886    0.000000e+00
887    0.000000e+00
888    0.000000e+00
889    0.000000e+00
890    0.000000e+00
Name: fare, Length: 891, dtype: float64

###var()  분산

In [39]:
# 평균
fare_mean = df['fare'].values.mean()

# 분산
my_var = ((df['fare'].values - fare_mean) ** 2).sum() / (df['fare'].count() - 1)
my_var

2469.436845743116

In [40]:
df['fare'].var()

2469.436845743117

###std() - 표준편차
분산(var)의 제곱근

In [41]:
np.sqrt(df['fare'].var())

49.693428597180905

In [42]:
np.sqrt(my_var)

49.6934285971809

##min() - 최소값, 
##max() - 최대값

In [43]:
df['age'].min()

0.42

In [44]:
df['age'].max()

80.0

##quantile() - 분위
Quantile이란 주어진 데이터를 동등한 크기로 분할하는 지점을 말합니다

10%의 경우 0.1을, 80%의 경우 0.8을 대입하여 값을 구합니다.

In [45]:
# 10% quantile
df['age'].quantile(0.1)

14.0

In [46]:
# 60% quantile
df['age'].quantile(0.6)

31.80000000000001

###unique() - 고유값, 
###nunique() - 고유값 개수
고유값과 고유값의 개수를 구하고자 할 때 사용합니다.

In [47]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [48]:
df['who'].nunique()

3

###mode() - 최빈값
최빈값은 가장 많이 출현한 데이터를 의미합니다.

In [49]:
df['who'].mode()

0    man
dtype: object

In [50]:
#카테고리 데이터에도 적용가능

df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

##corr() - 상관관계
corr()로 컬럼(column)별 상관관계를 확인할 수 있습니다.

-1~1 사이의 범위를 가집니다.

-1에 가까울 수록 반비례 관계, 1에 가까울수록 정비례 관계를 의미합니다.

In [51]:
df.corr()

            survived    pclass       age  ...      fare  adult_male     alone
survived    1.000000 -0.338481 -0.077221  ...  0.257307   -0.557080 -0.203367
pclass     -0.338481  1.000000 -0.369226  ... -0.549500    0.094035  0.135207
age        -0.077221 -0.369226  1.000000  ...  0.096067    0.280328  0.198270
sibsp      -0.035322  0.083081 -0.308247  ...  0.159651   -0.253586 -0.584471
parch       0.081629  0.018443 -0.189119  ...  0.216225   -0.349943 -0.583398
fare        0.257307 -0.549500  0.096067  ...  1.000000   -0.182024 -0.271832
adult_male -0.557080  0.094035  0.280328  ... -0.182024    1.000000  0.404744
alone      -0.203367  0.135207  0.198270  ... -0.271832    0.404744  1.000000

[8 rows x 8 columns]

In [52]:
df['survived'].corr()

TypeError: ignored

In [53]:
df.corr()['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64